{
    "config": {
        "version":1.0
    },
    "weight_map": {
        "model.language_model.embed_tokens.weight": [[0, 0]],
        "model.language_model.layers.{index}.self_attn.q_proj.weight": [[11, 0]],
        "model.language_model.layers.{index}.self_attn.k_proj.weight": [[11, 0]],
        "model.language_model.layers.{index}.self_attn.v_proj.weight": [[10, 0]],

        "model.language_model.layers.{index}.self_attn.o_proj.weight": [[10, 1]],

        "model.visual.patch_embed.proj.bias": [[14, 0]],
        "model.visual.patch_embed.proj.weight": [[2, 1, 0, 3], [13, 3, 0, 256], [14, 0]],
        "model.visual.pos_embed.weight": [[14, 1]],

        "model.visual.blocks.{vision_index}.norm1.weight": [[14, 0]],
        "model.visual.blocks.{vision_index}.norm1.bias": [[14, 0]],
        "model.visual.blocks.{vision_index}.attn.qkv.weight": [[14, 1]],
        "model.visual.blocks.{vision_index}.attn.proj.weight": [[14, 0]],
        "model.visual.blocks.{vision_index}.attn.proj.bias": [[14, 0]],
        "model.visual.blocks.{vision_index}.norm2.weight": [[14, 0]],
        "model.visual.blocks.{vision_index}.norm2.bias": [[14, 0]],
        "model.visual.blocks.{vision_index}.mlp.linear_fc1.weight": [[14, 1]],
        "model.visual.blocks.{vision_index}.mlp.linear_fc2.weight": [[14, 0]],
        "model.visual.blocks.{vision_index}.mlp.linear_fc2.bias": [[14, 0]],

        "model.visual.merger.norm.bias": [[14, 0]], 
        "model.visual.merger.norm.weight": [[14, 0]],
        "model.visual.merger.linear_fc1.weight": [[14, 1]], 
        "model.visual.deepstack_merger_list.0.norm.bias": [[14, 0]],
        "model.visual.deepstack_merger_list.0.norm.weight": [[14, 0]],
        "model.visual.deepstack_merger_list.0.linear_fc1.weight": [[14, 1]], 
        "model.visual.deepstack_merger_list.1.norm.bias": [[14, 0]],
        "model.visual.deepstack_merger_list.1.norm.weight": [[14, 0]],
        "model.visual.deepstack_merger_list.1.linear_fc1.weight": [[14, 1]], 
        "model.visual.deepstack_merger_list.2.norm.bias": [[14, 0]],
        "model.visual.deepstack_merger_list.2.norm.weight": [[14, 0]],
        "model.visual.deepstack_merger_list.2.linear_fc1.weight": [[14, 1]], 
        "lm_head.weight":[[0, 0]]
    }
}