{
    "config": {
        "version":1.0
    },
    "weight_map": {
        "model.embed_tokens.weight": [[0, 0]],

        "model.layers.{index}.self_attn.q_proj.weight": [[11, 0]],
        "model.layers.{index}.self_attn.k_proj.weight": [[11, 0]],
        "model.layers.{index}.self_attn.v_proj.weight": [[10, 0]],
        "model.layers.{index}.self_attn.o_proj.weight": [[10, 1]],

        "lm_head.weight": [[0, 0]]
    }
}
