{
    "config": {
        "version":1.0
    },
    "weight_map": {
        "model.embed_tokens.weight": [[0, 0], [3, 1]],

        "model.layers.{index}.self_attn.q_proj.weight": [[3, 1], [11, 0]],
        "model.layers.{index}.self_attn.k_proj.weight": [[3, 1], [11, 0]],
        "model.layers.{index}.self_attn.v_proj.weight": [[3, 1], [10, 0]],
        "model.layers.{index}.self_attn.o_proj.weight": [[3, 0], [10, 1]],
        "model.layers.{index}.mlp{experts_index}.gate_proj.weight": [[3, 1], [12, 0]],
        "model.layers.{index}.mlp{experts_index}.up_proj.weight": [[3, 1], [12, 0]],
        "model.layers.{index}.mlp{experts_index}.down_proj.weight": [[12, 1], [3, 0]],
        "model.layers.{index}.mlp.gate.weight":[[3, 1]],
        "model.layers.{index}.input_layernorm.weight": [[3, 0]],
        "model.layers.{index}.post_attention_layernorm.weight": [[3, 0]],

        "model.norm.weight": [[3, 0]],
        "lm_head.weight": [[0, 0], [3, 1]]
    }
}